MorgothCreator/mSdk/SDK/platform/stm32f4xx/interface/lcd_interface.c
  /* Enable the DSI host and wrapper : but LTDC is not started yet at this stage */
  HAL_DSI_Start(&(hdsi_eval));
/*************************End DSI Initialization*******************************/


/************************LTDC Initialization***********************************/

  /* Timing Configuration */
  LtdcHandler.Init.HorizontalSync = (HSA - 1);
  LtdcHandler.Init.AccumulatedHBP = (HSA + HBP - 1);
  LtdcHandler.Init.AccumulatedActiveW = (pDisplay->LcdTimings->X + HSA + HBP - 1);
  LtdcHandler.Init.TotalWidth = (pDisplay->LcdTimings->X + HSA + HBP + HFP - 1);

  /* Initialize the LCD pixel width and pixel height */
  LtdcHandler.LayerCfg->ImageWidth  = pDisplay->LcdTimings->X;
  LtdcHandler.LayerCfg->ImageHeight = pDisplay->LcdTimings->Y;


  PeriphClkInitStruct.PeriphClockSelection = PLL_REF_CLK / 1000000;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 417;
  PeriphClkInitStruct.PLLSAI.PLLSAIR = 7;
  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_2;
  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

  /* Background value */
  LtdcHandler.Init.Backcolor.Blue = 0;
  LtdcHandler.Init.Backcolor.Green = 0;
  LtdcHandler.Init.Backcolor.Red = 0;
  LtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  LtdcHandler.Instance = LTDC;

  /* Get LTDC Configuration from DSI Configuration */
  HAL_LTDC_StructInitFromVideoConfig(&(LtdcHandler), &(hdsivideo_handle));

  /* Initialize the LTDC */
  HAL_LTDC_Init(&LtdcHandler);

  /* Initialize the font */
  DMA2D_Config();
  BSP_LCD_LayerDefaultInit(_pDisplay, 0, LCD_FB_START_ADDRESS);
  //BSP_LCD_SetFont(&LCD_DEFAULT_FONT);

/************************End LTDC Initialization*******************************/


/***********************OTM8009A Initialization********************************/

  /* Initialize the OTM8009A LCD Display IC Driver (KoD LCD IC Driver)
  *  depending on configuration set in 'hdsivideo_handle'.
  */
  OTM8009A_Init(_pDisplay, hdsivideo_handle.ColorCoding);

/***********************End OTM8009A Initialization****************************/
  pDisplay->sClipRegion.sXMax = pDisplay->LcdTimings->X;
  pDisplay->sClipRegion.sYMax = pDisplay->LcdTimings->Y;
  return LCD_OK;
}
#endif
/**
  * @brief  Fills a buffer.
  * @param  LayerIndex: Layer index
  * @param  pDst: Pointer to destination buffer
  * @param  xSize: Buffer width
  * @param  ySize: Buffer height
  * @param  OffLine: Offset
  * @param  ColorIndex: Color index
  */
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
{
	  /*##-1- Configure the DMA2D Mode, Color Mode and output offset #############*/
	  Dma2dHandle.Init.Mode         = DMA2D_R2M;
	  Dma2dHandle.Init.ColorMode    = DMA2D_ARGB8888;
	  Dma2dHandle.Init.OutputOffset = OffLine;

  /* DMA2D Initialization */
  if(HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
  {
    if(HAL_DMA2D_ConfigLayer(&Dma2dHandle, LayerIndex) == HAL_OK)
    {
      if (HAL_DMA2D_Start(&Dma2dHandle, ColorIndex | 0xFF000000, (uint32_t)pDst, xSize, ySize) == HAL_OK)
      {
        /* Polling For DMA transfer */
        HAL_DMA2D_PollForTransfer(&Dma2dHandle, 100);
      }
    }
  }
}


#endif

#if defined(STM32F469xx) || defined(STM32F479xx)

bool SetUpLCD(void* LcdStruct)
{
	//screen_open(LcdStruct);
	if(BSP_LCD_InitEx(LcdStruct) == LCD_OK)
	{
		return true;
	}
	else
		return false;
#ifdef SSD2119
	STM32f4_Discovery_LCD_Init();
#endif
	return true;
}

/**********************************************/
void _lcd_enable()
{
	  /* Send Display on DCS command to display */
	  HAL_DSI_ShortWrite(&(hdsi_eval),
	                     hdsivideo_handle.VirtualChannelID,
	                     DSI_DCS_SHORT_PKT_WRITE_P1,
	                     OTM8009A_CMD_DISPON,
	                     0x00);
}
/**********************************************/
void _lcd_disable()
{
	  /* Send Display off DCS Command to display */
	  HAL_DSI_ShortWrite(&(hdsi_eval),
	                     hdsivideo_handle.VirtualChannelID,
	                     DSI_DCS_SHORT_PKT_WRITE_P1,
	                     OTM8009A_CMD_DISPOFF,
	                     0x00);
}
//#######################################################################################
void _screen_backlight_on(void *_pDisplay)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	gpio.out(pDisplay->BackLight, 1);
}
//#######################################################################################
void _screen_backlight_off(void *_pDisplay)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	gpio.out(pDisplay->BackLight, 0);
}
//#######################################################################################
bool _screen_copy(void *_pDisplayTo, void *_pDisplayFrom, bool put_cursor, signed int X, signed int Y, unsigned int color)
{
	tDisplay *pDisplayTo = (tDisplay *)_pDisplayTo;
	tDisplay *pDisplayFrom = (tDisplay *)_pDisplayFrom;
	if(pDisplayTo->LcdTimings->X != pDisplayFrom->LcdTimings->X || pDisplayTo->LcdTimings->Y != pDisplayFrom->LcdTimings->Y)
		return false;
	CacheDataCleanBuff((unsigned int)pDisplayFrom->DisplayData, (pDisplayFrom->LcdTimings->X * pDisplayFrom->LcdTimings->Y * sizeof(pDisplayFrom->DisplayData[0])) + (pDisplayFrom->LcdTimings->palete_len * sizeof(pDisplayFrom->DisplayData[0])));
	signed int LineCnt = 0;
	volatile unsigned int* ScreenBuff = pDisplayTo->DisplayData + pDisplayTo->LcdTimings->palete_len;
	volatile unsigned int* _ScreenBuff = pDisplayFrom->DisplayData + pDisplayTo->LcdTimings->palete_len;

	for(; LineCnt < pDisplayTo->LcdTimings->Y; LineCnt ++)
	{
		memcpy((void *)(ScreenBuff + (pDisplayFrom->LcdTimings->X * LineCnt)), (void *)(_ScreenBuff + (pDisplayFrom->LcdTimings->X * LineCnt)), (sizeof(ScreenBuff[0]) * pDisplayTo->LcdTimings->X));
		if(put_cursor == true && LineCnt >= Y && LineCnt <= Y + 2)
		{
			unsigned int cnt_x = X;
			for(;cnt_x < X + 2; cnt_x++)
				_put_pixel(pDisplayTo, cnt_x, LineCnt, color);
		}
	}
	return true;
}
//#######################################################################################
void _box_cache_clean(void *_pDisplay, signed int x_start, signed int y_start, signed int x_len, signed int y_len)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;

