MorgothCreator/mSdk/SDK/platform/stm32f4xx/interface/lcd_interface.c
}
//#######################################################################################
void _put_rectangle(void *_pDisplay, signed int x_start, signed int y_start, signed int x_len, signed int y_len, bool fill, unsigned int color)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	signed int x_end = x_start + x_len ,y_end = y_start + y_len;
	if(x_start >= pDisplay->sClipRegion.sXMax || y_start >= pDisplay->sClipRegion.sYMax || x_end < pDisplay->sClipRegion.sXMin || y_end < pDisplay->sClipRegion.sYMin)
		return;
	register signed int LineCnt = y_start;
	//volatile unsigned int* ScreenBuff = (volatile unsigned int *)LCD_FB_START_ADDRESS;
	unsigned int _color = color | 0xFF000000;
	if(fill)
	{
		if(LineCnt < pDisplay->sClipRegion.sYMin) LineCnt = pDisplay->sClipRegion.sYMin;
		signed int _x_start = x_start;
		if(_x_start < pDisplay->sClipRegion.sXMin) _x_start = pDisplay->sClipRegion.sXMin;
		register signed int _x_end = x_end;
		if(_x_end > pDisplay->sClipRegion.sXMax) _x_end = pDisplay->sClipRegion.sXMax;
		uint32_t  Xaddress = 0;
		Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress) + 4*(pDisplay->LcdTimings->X*LineCnt + _x_start);
		/* Fill the rectangle */
		LL_FillBuffer(0, (uint32_t *)Xaddress, _x_end - _x_start, y_end - LineCnt, pDisplay->LcdTimings->X - (_x_end - _x_start), _color);
		return;
	}

	_screen_put_horizontal_line(pDisplay, x_start, y_start, x_len - 1, 1, color);
	_screen_put_horizontal_line(pDisplay, x_start, (y_start + y_len) - 1, x_len, 1, color);
	_screen_put_vertical_line(pDisplay, x_start, y_start, y_len - 1, 1, color);
	_screen_put_vertical_line(pDisplay, (x_start + x_len) - 1, y_start, x_len, 1, color);
	return;
}
//#######################################################################################
void _put_pixel(void *_pDisplay, signed int X, signed int Y, unsigned int color)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	if(X >= pDisplay->sClipRegion.sXMin && Y >= pDisplay->sClipRegion.sYMin && X < pDisplay->sClipRegion.sXMax && Y < pDisplay->sClipRegion.sYMax)
	{
		uint32_t  Xaddress = 0;
		Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress) + 4*(pDisplay->LcdTimings->X*Y + X);
		/* Fill the rectangle */
		LL_FillBuffer(0, (uint32_t *)Xaddress, 1, 1, pDisplay->LcdTimings->X - 1, color | 0xFF000000);
	}
}
//#######################################################################################
void _screen_put_rgb_array_16(void *_pDisplay, unsigned short *rgb_buffer, unsigned int x1, unsigned int y1,unsigned int width, unsigned int height)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
}
//#######################################################################################
void _screen_put_rgb_array_24(void *_pDisplay, unsigned char *rgb_buffer, unsigned long x1, unsigned long y1,unsigned long width, unsigned long height)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
}
//#######################################################################################
void _screen_put_rgb_array_32(void *_pDisplay, unsigned char *rgb_buffer, unsigned int x1, unsigned int y1,unsigned int width, unsigned int height)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;

	/*//tWindow *ParentWindow = (tWindow*)settings->Internals.ParentWindow;
	//tDisplay *pDisplay = settings->Internals.pDisplay;
	//tRectangle back_up_clip = pDisplay->sClipRegion;
	//pDisplay->sClipRegion = settings->Internals.PictureWindowLimits;
	////put_pixel(pDisplay, X + settings->Position.X + 2, Y + settings->Position.Y + 2, color);
	tRectangle rectangle;
	rectangle.sXMin = 0;
	rectangle.sXMax = width;
	rectangle.sYMin = 0;
	rectangle.sYMax = height;
	tRectangle *dest_rectangle = &rectangle;
	tRectangle *src_rectangle = &rectangle;

	signed int dest_X_StartBox = x1;
	signed int dest_Y_StartBox = y1;
	//signed int dest_X_EndBox = settings->Internals.Position.X + settings->Internals.Size.X;
	//signed int dest_Y_EndBox = settings->Internals.Position.Y + settings->Internals.Size.Y;

	//Calculate the destination locations on the screen.
	dest_rectangle->sXMin += dest_X_StartBox;
	dest_rectangle->sXMax += dest_X_StartBox;
	dest_rectangle->sYMin += dest_Y_StartBox;
	dest_rectangle->sYMax += dest_Y_StartBox;
	if(dest_rectangle->sXMax < pDisplay->sClipRegion.sXMin ||
			dest_rectangle->sYMax < pDisplay->sClipRegion.sYMin ||
				dest_rectangle->sXMin >= pDisplay->sClipRegion.sXMax ||
					dest_rectangle->sYMin >= pDisplay->sClipRegion.sYMax)
		return;

	//Limit the destination area to the picture box size.
	clip_limit(dest_rectangle, &pDisplay->sClipRegion);

	signed int x_line_len = dest_rectangle->sXMax - dest_rectangle->sXMin;

	if(x_line_len <= 0)
		return;
	if(dest_X_StartBox <= dest_rectangle->sXMin)
		dest_X_StartBox = dest_rectangle->sXMin;

	signed int Y_cnt = dest_Y_StartBox;
	if(Y_cnt <= dest_rectangle->sYMin)
		Y_cnt = dest_rectangle->sYMin;

	signed int X_Start_Src_Buff = pDisplay->sClipRegion.sXMin;
	if(X_Start_Src_Buff > 0)
		X_Start_Src_Buff = 0;
	else
		X_Start_Src_Buff = (~X_Start_Src_Buff) + 1;
	signed int Y_Start_Src_Buff = pDisplay->sClipRegion.sYMin;
	if(Y_Start_Src_Buff > 0)
		Y_Start_Src_Buff = 0;
	else
		Y_Start_Src_Buff = (~Y_Start_Src_Buff) + 1;*/












	uint32_t destination = (uint32_t)((volatile unsigned int *)LCD_FB_START_ADDRESS) + ((y1 * pDisplay->LcdTimings->X + x1) * 4);
	uint32_t source      = (uint32_t)rgb_buffer;

	/*##-1- Configure the DMA2D Mode, Color Mode and output offset #############*/
	Dma2dHandle.Init.Mode         = DMA2D_M2M_PFC;
	Dma2dHandle.Init.ColorMode    = DMA2D_ARGB8888;
	Dma2dHandle.Init.OutputOffset = pDisplay->LcdTimings->X - width;

	/*##-2- DMA2D Callbacks Configuration ######################################*/
	Dma2dHandle.XferCpltCallback  = NULL;

	/*##-3- Foreground Configuration ###########################################*/
	Dma2dHandle.LayerCfg[0].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	Dma2dHandle.LayerCfg[0].InputAlpha = 0xFF;
	Dma2dHandle.LayerCfg[0].InputColorMode = CM_ARGB8888;
	Dma2dHandle.LayerCfg[0].InputOffset = 0;

	Dma2dHandle.Instance          = DMA2D;

