MorgothCreator/mSdk/SDK/platform/stm32f4xx/interface/lcd_interface.c
	/* DMA2D Initialization */
	if(HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
	{
		if(HAL_DMA2D_ConfigLayer(&Dma2dHandle, 0) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&Dma2dHandle, source, destination, width, height) == HAL_OK)
			{
				/* Polling For DMA transfer */
				HAL_DMA2D_PollForTransfer(&Dma2dHandle, 100);
			}
		}
	}
}
//#######################################################################################
void _screen_put_horizontal_line(void *_pDisplay, signed int X1, signed int X2, signed int Y, unsigned char width, unsigned int color)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	if(width == 1 && (Y < pDisplay->sClipRegion.sYMin || Y >= pDisplay->sClipRegion.sYMax))
		return;
	register int X1_Tmp = X1, X2_Tmp = X1 + X2;
	if(X1_Tmp <= (int)pDisplay->sClipRegion.sXMin) X1_Tmp = (int)pDisplay->sClipRegion.sXMin;
	if(X1_Tmp >= (int)pDisplay->sClipRegion.sXMax) X1_Tmp = (int)pDisplay->sClipRegion.sXMax;
	if(X2_Tmp <= (int)pDisplay->sClipRegion.sXMin) X2_Tmp = (int)pDisplay->sClipRegion.sXMin;
	if(X2_Tmp >= (int)pDisplay->sClipRegion.sXMax) X2_Tmp = (int)pDisplay->sClipRegion.sXMax;
	Y -= (width >> 1);
	if(Y < (int)pDisplay->sClipRegion.sYMin) Y = (int)pDisplay->sClipRegion.sYMin;
	if(Y >= (int)pDisplay->sClipRegion.sYMax) Y = (int)pDisplay->sClipRegion.sYMax;
#ifdef USE_16_BIT_COLOR_DEPTH
	unsigned int _color = color;
#else
	unsigned int _color = color | 0xFF000000;
#endif
	uint32_t  Xaddress = 0;
	Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress) + 4*(pDisplay->LcdTimings->X* Y + X1_Tmp);
	/* Fill the rectangle */
	LL_FillBuffer(0, (uint32_t *)Xaddress, X2_Tmp - X1_Tmp, width, pDisplay->LcdTimings->X - (X2_Tmp - X1_Tmp), _color);

}
//#######################################################################################
void _screen_put_vertical_line(void *_pDisplay, signed int Y1, signed int Y2, signed int X, unsigned char width, unsigned int color)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	if(width == 1 && (X < pDisplay->sClipRegion.sXMin || X >= pDisplay->sClipRegion.sXMax))
		return;
	register int Y1_Tmp = Y1, Y2_Tmp = Y1 + Y2;
	X -= (width >> 1);
	if(X <= (int)pDisplay->sClipRegion.sXMin) X = (int)pDisplay->sClipRegion.sXMin;
	if(X >= (int)pDisplay->sClipRegion.sXMax) X = (int)pDisplay->sClipRegion.sXMax;
	if(Y1_Tmp <= (int)pDisplay->sClipRegion.sYMin) Y1_Tmp = (int)pDisplay->sClipRegion.sYMin;
	if(Y1_Tmp >= (int)pDisplay->sClipRegion.sYMax) Y1_Tmp = (int)pDisplay->sClipRegion.sYMax;
	if(Y2_Tmp <= (int)pDisplay->sClipRegion.sYMin) Y2_Tmp = (int)pDisplay->sClipRegion.sYMin;
	if(Y2_Tmp >= (int)pDisplay->sClipRegion.sYMax) Y2_Tmp = (int)pDisplay->sClipRegion.sYMax;
#ifdef USE_16_BIT_COLOR_DEPTH
	unsigned int _color = color;
#else
	unsigned int _color = color | 0xFF000000;
#endif
	uint32_t  Xaddress = 0;
	Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress) + 4*(pDisplay->LcdTimings->X*Y1_Tmp + X);
	/* Fill the rectangle */
	LL_FillBuffer(0, (uint32_t *)Xaddress, width, Y2_Tmp - Y1_Tmp, pDisplay->LcdTimings->X - (width), _color);

}
//#######################################################################################
void _screen_clear(void *_pDisplay, unsigned int color)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	_put_rectangle(_pDisplay, 0, 0, pDisplay->LcdTimings->X, pDisplay->LcdTimings->Y, true, color);
}
#else

bool SetUpLCD(void* LcdStruct)
{
	return false;
}

/**********************************************/
void _lcd_enable()
{
}
/**********************************************/
void _lcd_disable()
{

}
//#######################################################################################
void _screen_backlight_on(void *pDisplay)
{

}
//#######################################################################################
void _screen_backlight_off(void *pDisplay)
{

}
//#######################################################################################
bool _screen_copy(void *pDisplayTo, void *pDisplayFrom, bool put_cursor, signed int X, signed int Y, unsigned int color)
{

	return true;
}
//#######################################################################################
void _box_cache_clean(void *pDisplay, signed int x_start, signed int y_start, signed int x_len, signed int y_len)
{

}
//#######################################################################################
void _put_rectangle(void *pDisplay, signed int x_start, signed int y_start, signed int x_len, signed int y_len, bool fill, unsigned int color)
{

}
//#######################################################################################
void _put_pixel(void *pDisplay, signed int X, signed int Y, unsigned int color)
{

}
//#######################################################################################
void _screen_put_rgb_array_16(void *pDisplay, unsigned short *rgb_buffer, unsigned int x1, unsigned int y1,unsigned int width, unsigned int height)
{

}
//#######################################################################################
void _screen_put_rgb_array_24(void *pDisplay, unsigned char *rgb_buffer, unsigned long x1, unsigned long y1,unsigned long width, unsigned long height)
{

}
//#######################################################################################
void _screen_put_rgb_array_32(void *pDisplay, unsigned char *rgb_buffer, unsigned int x1, unsigned int y1,unsigned int width, unsigned int height)
{

}
//#######################################################################################
void _screen_put_horizontal_line(void *pDisplay, signed int X1, signed int X2, signed int Y, unsigned char width, unsigned int color)
{

}
//#######################################################################################
void _screen_put_vertical_line(void *pDisplay, signed int Y1, signed int Y2, signed int X, unsigned char width, unsigned int color)
{

}
//#######################################################################################
void _screen_clear(void *pDisplay, unsigned int color)
{

}

#endif
